schedule-api/app/controllers/schedules_controller.rb

  def destroy
    @schedule = Schedule.find(params[:id])
---
SELECT  "schedules".* FROM "schedules" WHERE "schedules"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]